ordu1453/convCS/build/test/mocks/test_process/mock_stm32g4xx_hal.h
typedef void (* CMOCK_HAL_DBGMCU_EnableDBGStandbyMode_CALLBACK)(int cmock_num_calls);
void HAL_DBGMCU_EnableDBGStandbyMode_AddCallback(CMOCK_HAL_DBGMCU_EnableDBGStandbyMode_CALLBACK Callback);
void HAL_DBGMCU_EnableDBGStandbyMode_Stub(CMOCK_HAL_DBGMCU_EnableDBGStandbyMode_CALLBACK Callback);
#define HAL_DBGMCU_EnableDBGStandbyMode_StubWithCallback HAL_DBGMCU_EnableDBGStandbyMode_Stub
#define HAL_DBGMCU_DisableDBGStandbyMode_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_DBGMCU_DisableDBGStandbyMode requires _Ignore (not AndReturn)");
#define HAL_DBGMCU_DisableDBGStandbyMode_Ignore() HAL_DBGMCU_DisableDBGStandbyMode_CMockIgnore()
void HAL_DBGMCU_DisableDBGStandbyMode_CMockIgnore(void);
#define HAL_DBGMCU_DisableDBGStandbyMode_StopIgnore() HAL_DBGMCU_DisableDBGStandbyMode_CMockStopIgnore()
void HAL_DBGMCU_DisableDBGStandbyMode_CMockStopIgnore(void);
#define HAL_DBGMCU_DisableDBGStandbyMode_ExpectAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_DBGMCU_DisableDBGStandbyMode requires _Expect (not AndReturn)");
#define HAL_DBGMCU_DisableDBGStandbyMode_Expect() HAL_DBGMCU_DisableDBGStandbyMode_CMockExpect(__LINE__)
void HAL_DBGMCU_DisableDBGStandbyMode_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_HAL_DBGMCU_DisableDBGStandbyMode_CALLBACK)(int cmock_num_calls);
void HAL_DBGMCU_DisableDBGStandbyMode_AddCallback(CMOCK_HAL_DBGMCU_DisableDBGStandbyMode_CALLBACK Callback);
void HAL_DBGMCU_DisableDBGStandbyMode_Stub(CMOCK_HAL_DBGMCU_DisableDBGStandbyMode_CALLBACK Callback);
#define HAL_DBGMCU_DisableDBGStandbyMode_StubWithCallback HAL_DBGMCU_DisableDBGStandbyMode_Stub
#define HAL_SYSCFG_CCMSRAMErase_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_CCMSRAMErase requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_CCMSRAMErase_Ignore() HAL_SYSCFG_CCMSRAMErase_CMockIgnore()
void HAL_SYSCFG_CCMSRAMErase_CMockIgnore(void);
#define HAL_SYSCFG_CCMSRAMErase_StopIgnore() HAL_SYSCFG_CCMSRAMErase_CMockStopIgnore()
void HAL_SYSCFG_CCMSRAMErase_CMockStopIgnore(void);
#define HAL_SYSCFG_CCMSRAMErase_ExpectAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_CCMSRAMErase requires _Expect (not AndReturn)");
#define HAL_SYSCFG_CCMSRAMErase_Expect() HAL_SYSCFG_CCMSRAMErase_CMockExpect(__LINE__)
void HAL_SYSCFG_CCMSRAMErase_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_HAL_SYSCFG_CCMSRAMErase_CALLBACK)(int cmock_num_calls);
void HAL_SYSCFG_CCMSRAMErase_AddCallback(CMOCK_HAL_SYSCFG_CCMSRAMErase_CALLBACK Callback);
void HAL_SYSCFG_CCMSRAMErase_Stub(CMOCK_HAL_SYSCFG_CCMSRAMErase_CALLBACK Callback);
#define HAL_SYSCFG_CCMSRAMErase_StubWithCallback HAL_SYSCFG_CCMSRAMErase_Stub
#define HAL_SYSCFG_EnableMemorySwappingBank_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_EnableMemorySwappingBank requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_EnableMemorySwappingBank_Ignore() HAL_SYSCFG_EnableMemorySwappingBank_CMockIgnore()
void HAL_SYSCFG_EnableMemorySwappingBank_CMockIgnore(void);
#define HAL_SYSCFG_EnableMemorySwappingBank_StopIgnore() HAL_SYSCFG_EnableMemorySwappingBank_CMockStopIgnore()
void HAL_SYSCFG_EnableMemorySwappingBank_CMockStopIgnore(void);
#define HAL_SYSCFG_EnableMemorySwappingBank_ExpectAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_EnableMemorySwappingBank requires _Expect (not AndReturn)");
#define HAL_SYSCFG_EnableMemorySwappingBank_Expect() HAL_SYSCFG_EnableMemorySwappingBank_CMockExpect(__LINE__)
void HAL_SYSCFG_EnableMemorySwappingBank_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_HAL_SYSCFG_EnableMemorySwappingBank_CALLBACK)(int cmock_num_calls);
void HAL_SYSCFG_EnableMemorySwappingBank_AddCallback(CMOCK_HAL_SYSCFG_EnableMemorySwappingBank_CALLBACK Callback);
void HAL_SYSCFG_EnableMemorySwappingBank_Stub(CMOCK_HAL_SYSCFG_EnableMemorySwappingBank_CALLBACK Callback);
#define HAL_SYSCFG_EnableMemorySwappingBank_StubWithCallback HAL_SYSCFG_EnableMemorySwappingBank_Stub
#define HAL_SYSCFG_DisableMemorySwappingBank_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_DisableMemorySwappingBank requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_DisableMemorySwappingBank_Ignore() HAL_SYSCFG_DisableMemorySwappingBank_CMockIgnore()
void HAL_SYSCFG_DisableMemorySwappingBank_CMockIgnore(void);
#define HAL_SYSCFG_DisableMemorySwappingBank_StopIgnore() HAL_SYSCFG_DisableMemorySwappingBank_CMockStopIgnore()
void HAL_SYSCFG_DisableMemorySwappingBank_CMockStopIgnore(void);
#define HAL_SYSCFG_DisableMemorySwappingBank_ExpectAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_DisableMemorySwappingBank requires _Expect (not AndReturn)");
#define HAL_SYSCFG_DisableMemorySwappingBank_Expect() HAL_SYSCFG_DisableMemorySwappingBank_CMockExpect(__LINE__)
void HAL_SYSCFG_DisableMemorySwappingBank_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_HAL_SYSCFG_DisableMemorySwappingBank_CALLBACK)(int cmock_num_calls);
void HAL_SYSCFG_DisableMemorySwappingBank_AddCallback(CMOCK_HAL_SYSCFG_DisableMemorySwappingBank_CALLBACK Callback);
void HAL_SYSCFG_DisableMemorySwappingBank_Stub(CMOCK_HAL_SYSCFG_DisableMemorySwappingBank_CALLBACK Callback);
#define HAL_SYSCFG_DisableMemorySwappingBank_StubWithCallback HAL_SYSCFG_DisableMemorySwappingBank_Stub
#define HAL_SYSCFG_VREFBUF_VoltageScalingConfig_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_VREFBUF_VoltageScalingConfig requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_VREFBUF_VoltageScalingConfig_Ignore() HAL_SYSCFG_VREFBUF_VoltageScalingConfig_CMockIgnore()
void HAL_SYSCFG_VREFBUF_VoltageScalingConfig_CMockIgnore(void);
#define HAL_SYSCFG_VREFBUF_VoltageScalingConfig_StopIgnore() HAL_SYSCFG_VREFBUF_VoltageScalingConfig_CMockStopIgnore()
void HAL_SYSCFG_VREFBUF_VoltageScalingConfig_CMockStopIgnore(void);
#define HAL_SYSCFG_VREFBUF_VoltageScalingConfig_ExpectAndReturn(VoltageScaling, cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_VREFBUF_VoltageScalingConfig requires _Expect (not AndReturn)");
#define HAL_SYSCFG_VREFBUF_VoltageScalingConfig_Expect(VoltageScaling) HAL_SYSCFG_VREFBUF_VoltageScalingConfig_CMockExpect(__LINE__, VoltageScaling)
void HAL_SYSCFG_VREFBUF_VoltageScalingConfig_CMockExpect(UNITY_LINE_TYPE cmock_line, uint32_t VoltageScaling);
typedef void (* CMOCK_HAL_SYSCFG_VREFBUF_VoltageScalingConfig_CALLBACK)(uint32_t VoltageScaling, int cmock_num_calls);
void HAL_SYSCFG_VREFBUF_VoltageScalingConfig_AddCallback(CMOCK_HAL_SYSCFG_VREFBUF_VoltageScalingConfig_CALLBACK Callback);
void HAL_SYSCFG_VREFBUF_VoltageScalingConfig_Stub(CMOCK_HAL_SYSCFG_VREFBUF_VoltageScalingConfig_CALLBACK Callback);
#define HAL_SYSCFG_VREFBUF_VoltageScalingConfig_StubWithCallback HAL_SYSCFG_VREFBUF_VoltageScalingConfig_Stub
#define HAL_SYSCFG_VREFBUF_HighImpedanceConfig_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_VREFBUF_HighImpedanceConfig requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_VREFBUF_HighImpedanceConfig_Ignore() HAL_SYSCFG_VREFBUF_HighImpedanceConfig_CMockIgnore()
void HAL_SYSCFG_VREFBUF_HighImpedanceConfig_CMockIgnore(void);
#define HAL_SYSCFG_VREFBUF_HighImpedanceConfig_StopIgnore() HAL_SYSCFG_VREFBUF_HighImpedanceConfig_CMockStopIgnore()
void HAL_SYSCFG_VREFBUF_HighImpedanceConfig_CMockStopIgnore(void);
#define HAL_SYSCFG_VREFBUF_HighImpedanceConfig_ExpectAndReturn(Mode, cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_VREFBUF_HighImpedanceConfig requires _Expect (not AndReturn)");
#define HAL_SYSCFG_VREFBUF_HighImpedanceConfig_Expect(Mode) HAL_SYSCFG_VREFBUF_HighImpedanceConfig_CMockExpect(__LINE__, Mode)
void HAL_SYSCFG_VREFBUF_HighImpedanceConfig_CMockExpect(UNITY_LINE_TYPE cmock_line, uint32_t Mode);
typedef void (* CMOCK_HAL_SYSCFG_VREFBUF_HighImpedanceConfig_CALLBACK)(uint32_t Mode, int cmock_num_calls);
void HAL_SYSCFG_VREFBUF_HighImpedanceConfig_AddCallback(CMOCK_HAL_SYSCFG_VREFBUF_HighImpedanceConfig_CALLBACK Callback);
void HAL_SYSCFG_VREFBUF_HighImpedanceConfig_Stub(CMOCK_HAL_SYSCFG_VREFBUF_HighImpedanceConfig_CALLBACK Callback);
#define HAL_SYSCFG_VREFBUF_HighImpedanceConfig_StubWithCallback HAL_SYSCFG_VREFBUF_HighImpedanceConfig_Stub
#define HAL_SYSCFG_VREFBUF_TrimmingConfig_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_VREFBUF_TrimmingConfig requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_VREFBUF_TrimmingConfig_Ignore() HAL_SYSCFG_VREFBUF_TrimmingConfig_CMockIgnore()
void HAL_SYSCFG_VREFBUF_TrimmingConfig_CMockIgnore(void);
#define HAL_SYSCFG_VREFBUF_TrimmingConfig_StopIgnore() HAL_SYSCFG_VREFBUF_TrimmingConfig_CMockStopIgnore()
void HAL_SYSCFG_VREFBUF_TrimmingConfig_CMockStopIgnore(void);
#define HAL_SYSCFG_VREFBUF_TrimmingConfig_ExpectAndReturn(TrimmingValue, cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_VREFBUF_TrimmingConfig requires _Expect (not AndReturn)");
#define HAL_SYSCFG_VREFBUF_TrimmingConfig_Expect(TrimmingValue) HAL_SYSCFG_VREFBUF_TrimmingConfig_CMockExpect(__LINE__, TrimmingValue)
void HAL_SYSCFG_VREFBUF_TrimmingConfig_CMockExpect(UNITY_LINE_TYPE cmock_line, uint32_t TrimmingValue);
typedef void (* CMOCK_HAL_SYSCFG_VREFBUF_TrimmingConfig_CALLBACK)(uint32_t TrimmingValue, int cmock_num_calls);
void HAL_SYSCFG_VREFBUF_TrimmingConfig_AddCallback(CMOCK_HAL_SYSCFG_VREFBUF_TrimmingConfig_CALLBACK Callback);
void HAL_SYSCFG_VREFBUF_TrimmingConfig_Stub(CMOCK_HAL_SYSCFG_VREFBUF_TrimmingConfig_CALLBACK Callback);
#define HAL_SYSCFG_VREFBUF_TrimmingConfig_StubWithCallback HAL_SYSCFG_VREFBUF_TrimmingConfig_Stub
#define HAL_SYSCFG_EnableVREFBUF_Ignore() TEST_FAIL_MESSAGE("HAL_SYSCFG_EnableVREFBUF requires _IgnoreAndReturn");
#define HAL_SYSCFG_EnableVREFBUF_IgnoreAndReturn(cmock_retval) HAL_SYSCFG_EnableVREFBUF_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SYSCFG_EnableVREFBUF_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SYSCFG_EnableVREFBUF_StopIgnore() HAL_SYSCFG_EnableVREFBUF_CMockStopIgnore()
void HAL_SYSCFG_EnableVREFBUF_CMockStopIgnore(void);
#define HAL_SYSCFG_EnableVREFBUF_Expect() TEST_FAIL_MESSAGE("HAL_SYSCFG_EnableVREFBUF requires _ExpectAndReturn");
#define HAL_SYSCFG_EnableVREFBUF_ExpectAndReturn(cmock_retval) HAL_SYSCFG_EnableVREFBUF_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_SYSCFG_EnableVREFBUF_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SYSCFG_EnableVREFBUF_CALLBACK)(int cmock_num_calls);
void HAL_SYSCFG_EnableVREFBUF_AddCallback(CMOCK_HAL_SYSCFG_EnableVREFBUF_CALLBACK Callback);
void HAL_SYSCFG_EnableVREFBUF_Stub(CMOCK_HAL_SYSCFG_EnableVREFBUF_CALLBACK Callback);
#define HAL_SYSCFG_EnableVREFBUF_StubWithCallback HAL_SYSCFG_EnableVREFBUF_Stub
#define HAL_SYSCFG_DisableVREFBUF_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_DisableVREFBUF requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_DisableVREFBUF_Ignore() HAL_SYSCFG_DisableVREFBUF_CMockIgnore()
void HAL_SYSCFG_DisableVREFBUF_CMockIgnore(void);
#define HAL_SYSCFG_DisableVREFBUF_StopIgnore() HAL_SYSCFG_DisableVREFBUF_CMockStopIgnore()
void HAL_SYSCFG_DisableVREFBUF_CMockStopIgnore(void);
#define HAL_SYSCFG_DisableVREFBUF_ExpectAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_DisableVREFBUF requires _Expect (not AndReturn)");
#define HAL_SYSCFG_DisableVREFBUF_Expect() HAL_SYSCFG_DisableVREFBUF_CMockExpect(__LINE__)
void HAL_SYSCFG_DisableVREFBUF_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_HAL_SYSCFG_DisableVREFBUF_CALLBACK)(int cmock_num_calls);
void HAL_SYSCFG_DisableVREFBUF_AddCallback(CMOCK_HAL_SYSCFG_DisableVREFBUF_CALLBACK Callback);
void HAL_SYSCFG_DisableVREFBUF_Stub(CMOCK_HAL_SYSCFG_DisableVREFBUF_CALLBACK Callback);
#define HAL_SYSCFG_DisableVREFBUF_StubWithCallback HAL_SYSCFG_DisableVREFBUF_Stub
#define HAL_SYSCFG_EnableIOSwitchBooster_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_EnableIOSwitchBooster requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_EnableIOSwitchBooster_Ignore() HAL_SYSCFG_EnableIOSwitchBooster_CMockIgnore()
void HAL_SYSCFG_EnableIOSwitchBooster_CMockIgnore(void);
#define HAL_SYSCFG_EnableIOSwitchBooster_StopIgnore() HAL_SYSCFG_EnableIOSwitchBooster_CMockStopIgnore()
void HAL_SYSCFG_EnableIOSwitchBooster_CMockStopIgnore(void);
#define HAL_SYSCFG_EnableIOSwitchBooster_ExpectAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_EnableIOSwitchBooster requires _Expect (not AndReturn)");
#define HAL_SYSCFG_EnableIOSwitchBooster_Expect() HAL_SYSCFG_EnableIOSwitchBooster_CMockExpect(__LINE__)
void HAL_SYSCFG_EnableIOSwitchBooster_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_HAL_SYSCFG_EnableIOSwitchBooster_CALLBACK)(int cmock_num_calls);
void HAL_SYSCFG_EnableIOSwitchBooster_AddCallback(CMOCK_HAL_SYSCFG_EnableIOSwitchBooster_CALLBACK Callback);
void HAL_SYSCFG_EnableIOSwitchBooster_Stub(CMOCK_HAL_SYSCFG_EnableIOSwitchBooster_CALLBACK Callback);
#define HAL_SYSCFG_EnableIOSwitchBooster_StubWithCallback HAL_SYSCFG_EnableIOSwitchBooster_Stub
#define HAL_SYSCFG_DisableIOSwitchBooster_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_DisableIOSwitchBooster requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_DisableIOSwitchBooster_Ignore() HAL_SYSCFG_DisableIOSwitchBooster_CMockIgnore()
void HAL_SYSCFG_DisableIOSwitchBooster_CMockIgnore(void);
#define HAL_SYSCFG_DisableIOSwitchBooster_StopIgnore() HAL_SYSCFG_DisableIOSwitchBooster_CMockStopIgnore()
void HAL_SYSCFG_DisableIOSwitchBooster_CMockStopIgnore(void);
#define HAL_SYSCFG_DisableIOSwitchBooster_ExpectAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_DisableIOSwitchBooster requires _Expect (not AndReturn)");
#define HAL_SYSCFG_DisableIOSwitchBooster_Expect() HAL_SYSCFG_DisableIOSwitchBooster_CMockExpect(__LINE__)
void HAL_SYSCFG_DisableIOSwitchBooster_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_HAL_SYSCFG_DisableIOSwitchBooster_CALLBACK)(int cmock_num_calls);
void HAL_SYSCFG_DisableIOSwitchBooster_AddCallback(CMOCK_HAL_SYSCFG_DisableIOSwitchBooster_CALLBACK Callback);
void HAL_SYSCFG_DisableIOSwitchBooster_Stub(CMOCK_HAL_SYSCFG_DisableIOSwitchBooster_CALLBACK Callback);
#define HAL_SYSCFG_DisableIOSwitchBooster_StubWithCallback HAL_SYSCFG_DisableIOSwitchBooster_Stub
#define HAL_SYSCFG_EnableIOSwitchVDD_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_EnableIOSwitchVDD requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_EnableIOSwitchVDD_Ignore() HAL_SYSCFG_EnableIOSwitchVDD_CMockIgnore()
void HAL_SYSCFG_EnableIOSwitchVDD_CMockIgnore(void);
#define HAL_SYSCFG_EnableIOSwitchVDD_StopIgnore() HAL_SYSCFG_EnableIOSwitchVDD_CMockStopIgnore()
void HAL_SYSCFG_EnableIOSwitchVDD_CMockStopIgnore(void);
#define HAL_SYSCFG_EnableIOSwitchVDD_ExpectAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_EnableIOSwitchVDD requires _Expect (not AndReturn)");
#define HAL_SYSCFG_EnableIOSwitchVDD_Expect() HAL_SYSCFG_EnableIOSwitchVDD_CMockExpect(__LINE__)
void HAL_SYSCFG_EnableIOSwitchVDD_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_HAL_SYSCFG_EnableIOSwitchVDD_CALLBACK)(int cmock_num_calls);
void HAL_SYSCFG_EnableIOSwitchVDD_AddCallback(CMOCK_HAL_SYSCFG_EnableIOSwitchVDD_CALLBACK Callback);
void HAL_SYSCFG_EnableIOSwitchVDD_Stub(CMOCK_HAL_SYSCFG_EnableIOSwitchVDD_CALLBACK Callback);
#define HAL_SYSCFG_EnableIOSwitchVDD_StubWithCallback HAL_SYSCFG_EnableIOSwitchVDD_Stub
#define HAL_SYSCFG_DisableIOSwitchVDD_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_DisableIOSwitchVDD requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_DisableIOSwitchVDD_Ignore() HAL_SYSCFG_DisableIOSwitchVDD_CMockIgnore()
void HAL_SYSCFG_DisableIOSwitchVDD_CMockIgnore(void);
#define HAL_SYSCFG_DisableIOSwitchVDD_StopIgnore() HAL_SYSCFG_DisableIOSwitchVDD_CMockStopIgnore()
void HAL_SYSCFG_DisableIOSwitchVDD_CMockStopIgnore(void);
#define HAL_SYSCFG_DisableIOSwitchVDD_ExpectAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_DisableIOSwitchVDD requires _Expect (not AndReturn)");
#define HAL_SYSCFG_DisableIOSwitchVDD_Expect() HAL_SYSCFG_DisableIOSwitchVDD_CMockExpect(__LINE__)
void HAL_SYSCFG_DisableIOSwitchVDD_CMockExpect(UNITY_LINE_TYPE cmock_line);
typedef void (* CMOCK_HAL_SYSCFG_DisableIOSwitchVDD_CALLBACK)(int cmock_num_calls);
void HAL_SYSCFG_DisableIOSwitchVDD_AddCallback(CMOCK_HAL_SYSCFG_DisableIOSwitchVDD_CALLBACK Callback);
void HAL_SYSCFG_DisableIOSwitchVDD_Stub(CMOCK_HAL_SYSCFG_DisableIOSwitchVDD_CALLBACK Callback);
#define HAL_SYSCFG_DisableIOSwitchVDD_StubWithCallback HAL_SYSCFG_DisableIOSwitchVDD_Stub
#define HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_CCMSRAM_WriteProtectionEnable requires _Ignore (not AndReturn)");
#define HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_Ignore() HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_CMockIgnore()
void HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_CMockIgnore(void);
#define HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_StopIgnore() HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_CMockStopIgnore()
void HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_CMockStopIgnore(void);
#define HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_ExpectAndReturn(Page, cmock_retval) TEST_FAIL_MESSAGE("HAL_SYSCFG_CCMSRAM_WriteProtectionEnable requires _Expect (not AndReturn)");
#define HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_Expect(Page) HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_CMockExpect(__LINE__, Page)
void HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_CMockExpect(UNITY_LINE_TYPE cmock_line, uint32_t Page);
typedef void (* CMOCK_HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_CALLBACK)(uint32_t Page, int cmock_num_calls);
void HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_AddCallback(CMOCK_HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_CALLBACK Callback);
void HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_Stub(CMOCK_HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_CALLBACK Callback);
#define HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_StubWithCallback HAL_SYSCFG_CCMSRAM_WriteProtectionEnable_Stub

#ifdef __cplusplus
}
#endif

#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic pop
#endif
#endif

#endif
